app/controllers/forms_controller.rb

  def index
    @forms = Form.all
---
SELECT `forms`.* FROM `forms`

  def show
    @form = Form.find(params[:id])
---
SELECT `forms`.* FROM `forms` WHERE `forms`.`id` = 1 LIMIT 1

  def create
    @form = Form.new(params[:form])
    1.times { @form.firmas.build }
    1.times { @form.dils.build }
    1.times { @form.bilgisayars.build }
    1.times { @form.projes.build }
    1.times { @form.sertifikas.build }
    1.times { @form.referans.build }

    if @form.save
---
INSERT INTO `bilgisayars` (`bilgi`, `created_at`, `form_id`, `kategori`, `seviye`, `updated_at`) VALUES (NULL, '2016-01-08 07:57:40', 1, NULL, NULL, '2016-01-08 07:57:40')
INSERT INTO `dils` (`created_at`, `dil_adi`, `dil_seviye`, `form_id`, `updated_at`) VALUES ('2016-01-08 07:57:40', NULL, NULL, 1, '2016-01-08 07:57:40')
INSERT INTO `firmas` (`baslama`, `bitis`, `bolum`, `created_at`, `firma_adi`, `form_id`, `pozisyon`, `sektor`, `updated_at`) VALUES (NULL, NULL, NULL, '2016-01-08 07:57:39', NULL, 1, NULL, NULL, '2016-01-08 07:57:39')
INSERT INTO `forms` (`ad`, `adres`, `askerlik`, `ceptel`, `cinsiyet`, `created_at`, `dal_bol`, `dal_fak`, `dogum`, `egitim`, `ehliyet`, `engel`, `evtel`, `fakulte`, `il`, `ilce`, `image`, `lise_adi`, `lise_baslangic`, `lise_bitis`, `lise_bol`, `lise_derece`, `lise_tur`, `medeni`, `okul_adi`, `onyazi`, `ozgecmis`, `seviye`, `sigara`, `soyad`, `tc`, `ulke`, `uni_adi`, `uni_baslangic`, `uni_bitis`, `uni_dal`, `uni_derece`, `updated_at`, `uyruk`) VALUES ('', '', 'Seçiniz', '', NULL, '2016-01-08 07:57:39', '', '', '2016-01-08 00:00:00', 'Lise', NULL, '', '', NULL, '', '', NULL, '', '2016-01-08 00:00:00', '2016-01-08 00:00:00', 'Seçiniz', NULL, 'Seçiniz', 'Seçiniz', NULL, '', '', 'Seçiniz', NULL, '', '', 'Turkey', '', '2016-01-08 00:00:00', '2016-01-08 00:00:00', NULL, NULL, '2016-01-08 07:57:39', '')